"""
ამ ფაილში გაწერილია ყველა ფაილის სახელი რომლის გამოყენებაც შეიძლება დაგვჭირდეს.
ასე წერია excel ის ფაილში სვეტების სახელები და შესანახი ცხრილების სახელები
"""

"წამის excel-ების სახელები"

f1 = "Excels\\seconds\\00211224.xlsx"
f3 = "Excels\\seconds\\00211226.xlsx"
f2 = "Excels\\seconds\\00211225.xlsx"
f4 = "Excels\\seconds\\00211227.xlsx"
f5 = "Excels\\seconds\\00211228.xlsx"
f6 = "Excels\\seconds\\00211229.xlsx"
f7 = "Excels\\seconds\\00211230.xlsx"
f8 = "Excels\\seconds\\00211231.xlsx"
f9 = "Excels\\seconds\\00220101.xlsx"
f10 = "Excels\\seconds\\00220102.xlsx"
f11 = "Excels\\seconds\\00220103.xlsx"
f12 = "Excels\\seconds\\00220104.xlsx"
f13 = "Excels\\seconds\\00220105.xlsx"
f14 = "Excels\\seconds\\00220106.xlsx"
f15 = "Excels\\seconds\\01211224.xlsx"
f16 = "Excels\\seconds\\02211224.xlsx"
f17 = "Excels\\seconds\\03211224.xlsx"
f18 = "Excels\\seconds\\01211230.xlsx"

excels = [f1, f15, f16, f17, f2, f3, f4, f5, f6, f7, f18, f8, f9, f10, f11, f12, f13, f14]
# excels = [f4]    # დროის მხრივ თუ დაგჭირდებათ რომ მარტო ერთ ფაილზე იმუშავოთ ზედა სია ამით ჩაანაცვლეთ
"Nea excel"

nea = "Excels\\nea_data\\24 DCEMBER 2021 -06 JANUARY 2022 NEA data.xlsx"

"NEA-ს excel-ში ბევრი sheet გვაქვს რის გამოც მათი სახელები ცალკე ამოვწერე"

sheets = ["Sheet1",  "Sheet2", "Sheet3", "Sheet4", "Sheet5", "Sheet6", "Sheet7", "Sheet10", "Sheet11", "Sheet12",
          "Sheet13", "Sheet14", "Sheet15", "Sheet16"]
# sheets = ["Sheet4"]  # და პარალელურად აქაც ზედა სია ამით ჩაანაცვლეთ

"NEA-ს ცხრილის სათაურები"

neaCO = "CO_mg/m3"
neaNO = "NO_mg/m3"
neaNO2 = "NO2_mg/m3"
neaO3 = "O3_mg/m3"
neaDate = "Date&Time"

"წამების ცხრილის სათაურები"

secondCO = "CO"
secondNO = "NO"
secondNO2 = "NO2"
secondO3 = "O3"
secondO3NO2 = "O3NO2"
secondDate = "Date&Time"


"წამების ინტერვალები ქვესიმრავლეების დასაყოფად"

First15 = ["00", "01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12", "13", "14"]
Seconds15 = ["15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29"]
Third15 = ["30", "31", "32", "33", "34", "35", "36", "37", "38", "39", "40", "41", "42", "43", "44"]
Fourth15 = ["45", "46", "47", "48", "49", "50", "51", "52", "53", "54", "55", "56", "57", "58", "59"]


F9_1 = ["00", "01", "02", "03", "04", "05", "06"]
F9_2 = ["07", "08", "09", "10", "11", "12", "13"]
F9_3 = ["14", "15", "16", "17", "18", "19", "20"]
F9_4 = ["21", "22", "23", "24", "25", "26", "27"]
F9_5 = ["28", "29", "30", "31", "32", "33", "34"]
F9_6 = ["35", "36", "37", "38", "39", "40", "41"]
F9_7 = ["42", "43", "44", "45", "46", "47", "48"]
F9_8 = ["49", "50", "51", "52", "53", "54", "55"]
F9_9 = ["56", "57", "58", "59"]
